{
  "component.element.name": "Asem Qaffaf",
  "nav.element.home": "Startseite",
  "nav.element.news": "Nachrichten",
  "nav.element.about": "Über",
  "nav.element.portfolio": "Portfolio",
  "nav.element.contact": "Kontakt",
  "page.home.head.title": "Asem Qaffaf",
  "page.home.head.meta.description": "Senior Full-Stack Softwareentwickler",
  "page.home.title": "Senior Full-Stack Entwickler mit einer Leidenschaft für Innovation.",
  "page.home.description": "Hallo, mein Name ist",
  "page.home.description-2": "Asem Qaffaf.",
  "page.home.description-3": "Ich bin darauf bedacht, durch das Entwerfen und Implementieren von hochgradig effizienten Systemen einen bedeutenden globalen Einfluss zu schaffen.",
  "page.about.title": "Befähigung von Unternehmen weltweit.",
  "page.about.paragraph": "Als Senior Softwareentwickler ist meine Karriere geprägt von einer außergewöhnlichen Erfolgsgeschichte in der Entwicklung innovativer Lösungen, mit bedeutenden Beiträgen zu multinationalen Projekten in Japan, Europa und den USA. Meine Expertise erstreckt sich über JavaScript hinaus auf eine breite Palette von Programmiersprachen wie Python, PHP und Java, was es mir ermöglicht, komplexe Softwareherausforderungen anzugehen. Meine Kenntnisse in Frameworks wie React.js/Native, Node.js und Flask waren entscheidend für den Aufbau robuster, skalierbarer Anwendungen. Zusätzlich verstärken meine Fähigkeiten in Cloud-Computing mit Plattformen wie AWS, GCP und Azure sowie meine Expertise im Datenbankmanagement in Systemen wie DynamoDB, MongoDB und MySQL meine Vielseitigkeit als Entwickler. Ich bin stolz auf meine Fähigkeit, den Zustand effektiv mit Werkzeugen wie MobX, Redux und React-Hooks Context API zu verwalten. Mein Ansatz im Softwareengineering ist gekennzeichnet durch eine starke organisatorische Fähigkeit und Selbstmotivation, untermauert von meinem Engagement für Exzellenz und positiven Einfluss im Bereich. Dieses vielfältige Fähigkeitenset definiert nicht nur meinen beruflichen Weg, sondern unterstreicht auch meine Hingabe, an der Spitze der technologischen Innovation zu bleiben und bedeutungsvoll zur Softwareentwicklungsgemeinschaft beizutragen.",
  "page.about.brief": "Als Senior Softwareentwickler mit umfangreicher Erfahrung in Japan, Europa und den USA, zeichne ich mich durch die Bereitstellung innovativer Lösungen mit meinen starken JavaScript-Fähigkeiten aus. Bekannt für außergewöhnliche Organisation und Selbstmotivation, bin ich zutiefst dem positiven Einfluss in der Tech-Industrie verpflichtet, strebe konsequent nach Exzellenz und trage bedeutend zum Bereich der Softwareentwicklung bei.",
  "page.about.work-experience": "Stunden Berufserfahrung",
  "page.about.projects-contributed": "Beigetragene Projekte",
  "page.about.tech-frameworks": "Technologien und Frameworks",
  "page.about.countries": "Länder",
  "page.Portfolio.title": "Als zentraler Mitwirkender an zahlreichen bedeutenden Projekten",
  "page.contact.title": "Kontaktieren Sie Mich",
  "page.contact.sub-title": "In Kontakt treten",
  "page.contact.email": "Ihre E-Mail",
  "page.contact.email-placeholder": "name@beispiel.com",
  "page.contact.subject": "Betreff",
  "page.contact.subject-placeholder": "Lassen Sie mich wissen, wie ich Ihnen helfen kann",
  "page.contact.your-message": "Ihre Nachricht",
  "page.contact.your-message-placeholder": "Hinterlassen Sie einen Kommentar...",
  "page.contact.send-message": "Nachricht senden",
  "footer.element.title": "Asem Qaffaf",
  "footer.element.address": "Roppongi",
  "footer.element.address-2": "Minato City, Tokyo Japan",
  "footer.element.col-1-title": "Ressourcen",
  "footer.element.col-1-1": "Über",
  "footer.element.col-1-2": "Portfolio",
  "footer.element.col-1-3": "Tech-Newsletter",
  "footer.element.col-1-4": "Influencer & Endorsement",
  "footer.element.col-1-5": "Kontakt",
  "footer.element.col-2-title": "Folgen Sie mir",
  "footer.element.col-2-1": "Github",
  "footer.element.col-2-2": "LinkedIn",
  "footer.element.col-2-3": "Facebook",
  "footer.element.col-3-title": "Externe Links",
  "footer.element.col-3-1": "TypeScript",
  "footer.element.col-3-2": "React",
  "footer.element.col-3-3": "Next.js 14",
  "footer.element.copyrights": "asemqaffaf. Entwickelt mit Next.js Handcodiert mit Liebe."
}